# Welcome to Pandas Tutorial

In [2]:
import numpy as np
import pandas as pd

In [3]:
dict1 = {
    "name":['sandip', 'rohan', 'suman', 'kabir'],
    "marks":[92, 34, 24, 17],
    "city":['rampur', 'kolkata', 'delhi', 'antartica']
}

In [9]:
df = pd.DataFrame(dict1)

In [11]:
df

     name  marks       city
0  sandip     92     rampur
1   rohan     34    kolkata
2   suman     24      delhi
3   kabir     17  antartica

In [13]:
df.to_csv('friends.csv')

In [15]:
df.to_csv('friends_indexfalse.csv', index=False)

In [17]:
df.head(2)

     name  marks     city
0  sandip     92   rampur
1   rohan     34  kolkata

In [19]:
df.tail(2)

    name  marks       city
2  suman     24      delhi
3  kabir     17  antartica

In [21]:
df.describe()

          marks
count   4.00000
mean   41.75000
std    34.21866
min    17.00000
25%    22.25000
50%    29.00000
75%    48.50000
max    92.00000

In [23]:
dict2 = {
    "trainNo":['11234', '986625', '1123554', '112345'],
    "speed":[30, 40, 70, 20],
    "city":['rampur', 'kolkata', 'delhi', 'antartica']
}

In [25]:
df = pd.DataFrame(dict2)

In [27]:
df

   trainNo  speed       city
0    11234     30     rampur
1   986625     40    kolkata
2  1123554     70      delhi
3   112345     20  antartica

In [29]:
df.to_csv('train.csv', index=False)

In [33]:
train = pd.read_csv('train.csv')

In [35]:
train

   trainNo  speed       city
0    11234     30     rampur
1   986625     40    kolkata
2  1123554     70      delhi
3   112345     20  antartica

In [39]:
df.to_csv('train.csv', index=False)

In [41]:
train.index = ['first', 'second', 'third', 'fourth']

In [43]:
train

        trainNo  speed       city
first     11234     30     rampur
second   986625     40    kolkata
third   1123554     70      delhi
fourth   112345     20  antartica